PeterDarley/lightmotron/c_project/sdkconfig.defaults
# Lightmotron ESP32-S3 default configuration
# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# PSRAM (Octal PSRAM on N16R8)
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# SPIFFS
CONFIG_SPIFFS_MAX_PARTITIONS=2
# Default (32) is too short for nested web asset paths like
# "/templates/scenes/select_scene_button_immediate.html" (52 chars).
CONFIG_SPIFFS_OBJ_NAME_LEN=64

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# LWIP
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_SO_REUSE=y

# Main/app_main task: default 3584 bytes is not enough headroom to call
# lighting_activate_boot_scenes() -> activate_scene() from boot.c -- that
# call chain's scene_metadata_t local alone (5 fixed char[8][64] arrays) is
# ~2.1KB, on top of boot_init()'s own already-substantial flat local-variable
# footprint (one long function, nothing returns until boot completes).
# Overflowed with just a 7-job scene, causing a double-exception crash right
# after "Scene activated" logged. This stack is freed once app_main()
# returns (after animation_start()), so the larger size is a one-time
# boot-time cost, not a standing internal-RAM reservation.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
# Precise (hardware watchpoint) stack-overflow detection -- catches the
# exact overrunning write instead of letting corrupted state crash
# somewhere unrelated later.
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y

# mDNS
CONFIG_MDNS_MAX_SERVICES=4

# mbedTLS: use PSRAM for its SSL buffers (16KB in + 4KB out per connection,
# plus handshake/cert-bundle state) instead of internal DRAM -- otherwise
# every HTTPS connection (OTA check/download) competes with the webserver's
# client-task stacks for the same scarce internal RAM pool.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# Task Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Target
CONFIG_IDF_TARGET="esp32s3"
